cosc583/proj_ukm2/writeup.org
#+title: Usable Key Management Pt. 2
#+author: Jackson Mowry
#+date: Mon Dec  1 17:19:09 2025
#+options: toc:nil num:nil \n:t


* Section 1—Activity 1
** How long did it take you to complete this activity?
10 Minutes
** What steps did you take to complete the activity?
- Include details about anything you attempted that ultimately did not work.
- Include screenshots if you think that would be helpful.

I exported my gpg private key, copied it over to hydra, installed the key, and enabled commit signing.
=gpg --export-secret-keys --armor YOUR_KEY_ID > private-key.asc=
** Identify the tools you used.
- Also, include details about any tools you ultimately abandoned.
  - Describe what went well with these tools and what was challenging.

I used the same tools as part 1, just the gpg & git command line tools. Both tools were easy to use and I had no issues.
** Describe what information sources you used and how helpful (or unhelpful) they were.
- Why did you need to use them?
- Why were they helpful (or unhelpful)?

I needed to look up the correct set of flags to export my private key, which I found at [[https://gist.github.com/luckygoswami/3f7cd9a2a7787314d44290941f0665f3]].
** To complete this activity, you could either copy your private key to the new machine or generate a new key pair for the new machine. Which approach did you choose? Why?
Answer the following questions:
- What were the easiest one or two steps in setting up Git commit signing on a second device? Why were they the easiest?
  - The easiest step was exporting my gpg private key. This was the easiest as I copied a command.
- What were the hardest one or two steps in setting up Git commit signing on a second device? Why were they the hardest?
  - The hardest step was copying my gpg key over because UTK requires me to use a VPN in order to be able to SSH onto a computer.
- What would you change about the process for setting up Git commit signing on a second device, if anything?
  - Nothing needs to change in my opinion.
Answer the after-scenario questionnaire (ASQ) by indicating how much you agree with the following statements on a scale of 1 (strongly disagree) to 7 (strongly agree).
- Overall, I am satisfied with the ease of setting up and using commit signing on a second device.
  - 7
- Overall, I am satisfied with the amount of time it took to set up and use Git commit signing on a second device.
  - 7
- Overall, I am satisfied with the support information (online help, messages, documentation) I found when setting up and using commit signing on a second device.
  - 7
** Provide any other feedback you have about this activity or Git commit signing on a second device.
I have no other feedback.
* Section 2—Activity 2
** Did you identify any commits that you think are problematic?
- If so, what was problematic about that commit?
- Provide these details for each commit you believe is problematic.

On either end of the commit list we have 2 commits that are both years apart from the rest of the commits. I find this suspicious, and would suspect that these commits have had their dates modified.
Within the bulk of the commits we have most commits showing as verified and properly signed, mixed in with a few unverified commits, and some that are not signed. The commits from Dr. Ruoti seem to be the most problematic as there is never a signing key associated with his commits. Additionally, individual commits from both John and Abubakar are not signed, which does not instill confidence that these commits are legitimate. Ultimately, it would be up to the developer choosing to consume this library to enact their own policy according to the level of risk they are willing to take in 3rd party code.
** How long did it take you to complete this activity?
10 minutes.
