cosc583/proj_ukm2/writeup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-01 Mon 18:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Usable Key Management Pt. 2</title>
<meta name="author" content="Jackson Mowry" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Usable Key Management Pt. 2</h1>
<div id="outline-container-orgcf8c7e9" class="outline-2">
<h2 id="orgcf8c7e9">Section 1—Activity 1</h2>
<div class="outline-text-2" id="text-orgcf8c7e9">
</div>
<div id="outline-container-org73e496d" class="outline-3">
<h3 id="org73e496d">How long did it take you to complete this activity?</h3>
<div class="outline-text-3" id="text-org73e496d">
<p>
10 Minutes<br />
</p>
</div>
</div>
<div id="outline-container-org3139327" class="outline-3">
<h3 id="org3139327">What steps did you take to complete the activity?</h3>
<div class="outline-text-3" id="text-org3139327">
<ul class="org-ul">
<li>Include details about anything you attempted that ultimately did not work.<br /></li>
<li>Include screenshots if you think that would be helpful.<br /></li>
</ul>

<p>
I exported my gpg private key, copied it over to hydra, installed the key, and enabled commit signing.<br />
<code>gpg --export-secret-keys --armor YOUR_KEY_ID &gt; private-key.asc</code><br />
</p>
</div>
</div>
<div id="outline-container-org349f6d1" class="outline-3">
<h3 id="org349f6d1">Identify the tools you used.</h3>
<div class="outline-text-3" id="text-org349f6d1">
<ul class="org-ul">
<li>Also, include details about any tools you ultimately abandoned.<br />
<ul class="org-ul">
<li>Describe what went well with these tools and what was challenging.<br /></li>
</ul></li>
</ul>

<p>
I used the same tools as part 1, just the gpg &amp; git command line tools. Both tools were easy to use and I had no issues.<br />
</p>
</div>
</div>
<div id="outline-container-orgf900b79" class="outline-3">
<h3 id="orgf900b79">Describe what information sources you used and how helpful (or unhelpful) they were.</h3>
<div class="outline-text-3" id="text-orgf900b79">
<ul class="org-ul">
<li>Why did you need to use them?<br /></li>
<li>Why were they helpful (or unhelpful)?<br /></li>
</ul>

<p>
I needed to look up the correct set of flags to export my private key, which I found at <a href="https://gist.github.com/luckygoswami/3f7cd9a2a7787314d44290941f0665f3">https://gist.github.com/luckygoswami/3f7cd9a2a7787314d44290941f0665f3</a>.<br />
</p>
</div>
</div>
<div id="outline-container-org67bdbc6" class="outline-3">
<h3 id="org67bdbc6">To complete this activity, you could either copy your private key to the new machine or generate a new key pair for the new machine. Which approach did you choose? Why?</h3>
<div class="outline-text-3" id="text-org67bdbc6">
<p>
Answer the following questions:<br />
</p>
<ul class="org-ul">
<li>What were the easiest one or two steps in setting up Git commit signing on a second device? Why were they the easiest?<br />
<ul class="org-ul">
<li>The easiest step was exporting my gpg private key. This was the easiest as I copied a command.<br /></li>
</ul></li>
<li>What were the hardest one or two steps in setting up Git commit signing on a second device? Why were they the hardest?<br />
<ul class="org-ul">
<li>The hardest step was copying my gpg key over because UTK requires me to use a VPN in order to be able to SSH onto a computer.<br /></li>
</ul></li>
<li>What would you change about the process for setting up Git commit signing on a second device, if anything?<br />
<ul class="org-ul">
<li>Nothing needs to change in my opinion.<br /></li>
</ul></li>
</ul>
<p>
Answer the after-scenario questionnaire (ASQ) by indicating how much you agree with the following statements on a scale of 1 (strongly disagree) to 7 (strongly agree).<br />
</p>
<ul class="org-ul">
<li>Overall, I am satisfied with the ease of setting up and using commit signing on a second device.<br />
<ul class="org-ul">
<li>7<br /></li>
</ul></li>
<li>Overall, I am satisfied with the amount of time it took to set up and use Git commit signing on a second device.<br />
<ul class="org-ul">
<li>7<br /></li>
</ul></li>
<li>Overall, I am satisfied with the support information (online help, messages, documentation) I found when setting up and using commit signing on a second device.<br />
<ul class="org-ul">
<li>7<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org827e5d2" class="outline-3">
<h3 id="org827e5d2">Provide any other feedback you have about this activity or Git commit signing on a second device.</h3>
<div class="outline-text-3" id="text-org827e5d2">
<p>
I have no other feedback.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org795cc39" class="outline-2">
<h2 id="org795cc39">Section 2—Activity 2</h2>
<div class="outline-text-2" id="text-org795cc39">
</div>
<div id="outline-container-org62451ec" class="outline-3">
<h3 id="org62451ec">Did you identify any commits that you think are problematic?</h3>
<div class="outline-text-3" id="text-org62451ec">
<ul class="org-ul">
<li>If so, what was problematic about that commit?<br /></li>
<li>Provide these details for each commit you believe is problematic.<br /></li>
</ul>

<p>
On either end of the commit list we have 2 commits that are both years apart from the rest of the commits. I find this suspicious, and would suspect that these commits have had their dates modified.<br />
Within the bulk of the commits we have most commits showing as verified and properly signed, mixed in with a few unverified commits, and some that are not signed. The commits from Dr. Ruoti seem to be the most problematic as there is never a signing key associated with his commits. Additionally, individual commits from both John and Abubakar are not signed, which does not instill confidence that these commits are legitimate. Ultimately, it would be up to the developer choosing to consume this library to enact their own policy according to the level of risk they are willing to take in 3rd party code.<br />
</p>
</div>
</div>
