cosc583/proj_ukm2/writeup.tex
% Created 2025-12-01 Mon 18:18
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jackson Mowry}
\date{Mon Dec  1 17:19:09 2025}
\title{Usable Key Management Pt. 2}
\hypersetup{
 pdfauthor={Jackson Mowry},
 pdftitle={Usable Key Management Pt. 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Section 1—Activity 1}
\label{sec:org621cb4c}
\subsection*{How long did it take you to complete this activity?}
\label{sec:org2f2185a}
10 Minutes\\
\subsection*{What steps did you take to complete the activity?}
\label{sec:org2e28c04}
\begin{itemize}
\item Include details about anything you attempted that ultimately did not work.\\
\item Include screenshots if you think that would be helpful.\\
\end{itemize}

I exported my gpg private key, copied it over to hydra, installed the key, and enabled commit signing.\\
\texttt{gpg -{}-{}export-secret-keys -{}-{}armor YOUR\_KEY\_ID > private-key.asc}\\
\subsection*{Identify the tools you used.}
\label{sec:orga07514d}
\begin{itemize}
\item Also, include details about any tools you ultimately abandoned.\\
\begin{itemize}
\item Describe what went well with these tools and what was challenging.\\
\end{itemize}
\end{itemize}

I used the same tools as part 1, just the gpg \& git command line tools. Both tools were easy to use and I had no issues.\\
\subsection*{Describe what information sources you used and how helpful (or unhelpful) they were.}
\label{sec:orgb0e18cb}
\begin{itemize}
\item Why did you need to use them?\\
\item Why were they helpful (or unhelpful)?\\
\end{itemize}

I needed to look up the correct set of flags to export my private key, which I found at \url{https://gist.github.com/luckygoswami/3f7cd9a2a7787314d44290941f0665f3}.\\
\subsection*{To complete this activity, you could either copy your private key to the new machine or generate a new key pair for the new machine. Which approach did you choose? Why?}
\label{sec:orge9a2b96}
Answer the following questions:\\
\begin{itemize}
\item What were the easiest one or two steps in setting up Git commit signing on a second device? Why were they the easiest?\\
\begin{itemize}
\item The easiest step was exporting my gpg private key. This was the easiest as I copied a command.\\
\end{itemize}
\item What were the hardest one or two steps in setting up Git commit signing on a second device? Why were they the hardest?\\
\begin{itemize}
\item The hardest step was copying my gpg key over because UTK requires me to use a VPN in order to be able to SSH onto a computer.\\
\end{itemize}
\item What would you change about the process for setting up Git commit signing on a second device, if anything?\\
\begin{itemize}
\item Nothing needs to change in my opinion.\\
\end{itemize}
\end{itemize}
Answer the after-scenario questionnaire (ASQ) by indicating how much you agree with the following statements on a scale of 1 (strongly disagree) to 7 (strongly agree).\\
\begin{itemize}
\item Overall, I am satisfied with the ease of setting up and using commit signing on a second device.\\
\begin{itemize}
\item 7\\
\end{itemize}
\item Overall, I am satisfied with the amount of time it took to set up and use Git commit signing on a second device.\\
\begin{itemize}
\item 7\\
\end{itemize}
\item Overall, I am satisfied with the support information (online help, messages, documentation) I found when setting up and using commit signing on a second device.\\
\begin{itemize}
\item 7\\
\end{itemize}
\end{itemize}
\subsection*{Provide any other feedback you have about this activity or Git commit signing on a second device.}
\label{sec:org0c0e9e9}
I have no other feedback.\\
\section*{Section 2—Activity 2}
\label{sec:org19d55e9}
\subsection*{Did you identify any commits that you think are problematic?}
\label{sec:org67e796d}
\begin{itemize}
\item If so, what was problematic about that commit?\\
\item Provide these details for each commit you believe is problematic.\\
\end{itemize}

On either end of the commit list we have 2 commits that are both years apart from the rest of the commits. I find this suspicious, and would suspect that these commits have had their dates modified.\\
Within the bulk of the commits we have most commits showing as verified and properly signed, mixed in with a few unverified commits, and some that are not signed. The commits from Dr. Ruoti seem to be the most problematic as there is never a signing key associated with his commits. Additionally, individual commits from both John and Abubakar are not signed, which does not instill confidence that these commits are legitimate. Ultimately, it would be up to the developer choosing to consume this library to enact their own policy according to the level of risk they are willing to take in 3rd party code.\\
