cosc583/proj_ukm2/writeup.org
** What steps did you take to complete the activity?
- Include details about anything you attempted that ultimately did not work.
- Include screenshots if you think that would be helpful.

I cloned the repo, added the developers keys to my local store of keys, and then ran =git log --show-signature=.
** Identify the tools you used.
- Also, include details about any tools you ultimately abandoned.
- Describe what went well with these tools and what was challenging.

I used the git cli.
** Describe what information sources you used and how helpful (or unhelpful) they were.
- Why did you need to use them?
- Why were they helpful (or unhelpful)?

I did not need any external sources.
** -Answer the following questions:
- What were the easiest one or two steps in analyzing the Git commit history? Why were they the easiest?
  - The easiest was cloning the git repo, this is something I do almost daily so it is easy.
- What were the hardest one or two steps in analyzing the Git commit history? Why were they the hardest?
  - The hardest part was adding the developers keys to my local store, because I initially forgot where those keys live.
- What would you change about the process of analyzing the Git commit history, if anything?
  - Nothing.
** Answer the after-scenario questionnaire (ASQ) by indicating how much you agree with the following statements on a scale of 1 (strongly disagree) to 7 (strongly agree).
- Overall, I am satisfied with the ease of analyzing the Git commit history.
  - 7
- Overall, I am satisfied with the amount of time it took to analyzing the Git commit history.
  - 7
- Overall, I am satisfied with the support information (online help, messages, documentation) I found when analyzing the Git commit history.
  - 7
** Provide any other feedback you have about this activity or analyzing Git commit histories.
None.
* Section 3—Semester-long reflection
** For this section, please reflect on your experience using Git commit signing in the second half of the semester.
Git commit signing is something that I have been doing for a few years now so the entire process was familiar to me. I think it's a good experience, especially with the guidance from your choice of git hosting provider guiding you along the way.
** Where did you store your private key? How was it secured?
My private key was stored password protected on my laptop.
** Did you change anything about how you signed commits throughout the second half of the semester? If so, what changes did you make? Why did you make those changes?
I did not, I chose the correct method the first time around.
** Do you plan to start signing your Git commits outside of this class? Why or why not?
Yes, I will continue to sign my commits outside of the class. I like to provide my collaborators with the confidence that I am truly the one creating commits.
** Answer the system usability scale (SUS) questions by indicating how much you agree with the following statements on a scale of 1 (strongly agree) to 5 (strongly disagree).
- I think that I would have no problem using Git commit signing frequently.
  - 5
- I found using Git commit signing unnecessarily complex.
  - 1
- I thought that using Git commit signing was easy.
  - 5
- I think that I would need the support of a technical support staff to use Git commit signing in the future.
  - 1
- I found the various functions for using Git commit signing to be well-integrated.
  - 5
- I thought there was too much inconsistency in using Git commit signing.
  - 1
- I would imagine that most people would learn to use Git commit signing very quickly.
  - 4
- I found using Git commit signing to be very cumbersome.
  - 1
- I felt very confident using Git commit signing.
  - 5
- I needed to learn a lot of things before I could get going with using Git commit signing.
  - 1
