cosc583/proj_ukm2/writeup.html
<div id="outline-container-orgec015f5" class="outline-3">
<h3 id="orgec015f5">How long did it take you to complete this activity?</h3>
<div class="outline-text-3" id="text-orgec015f5">
<p>
10 minutes.<br />
</p>
</div>
</div>
<div id="outline-container-org4e10a75" class="outline-3">
<h3 id="org4e10a75">What steps did you take to complete the activity?</h3>
<div class="outline-text-3" id="text-org4e10a75">
<ul class="org-ul">
<li>Include details about anything you attempted that ultimately did not work.<br /></li>
<li>Include screenshots if you think that would be helpful.<br /></li>
</ul>

<p>
I cloned the repo, added the developers keys to my local store of keys, and then ran <code>git log --show-signature</code>.<br />
</p>
</div>
</div>
<div id="outline-container-orge2c59cb" class="outline-3">
<h3 id="orge2c59cb">Identify the tools you used.</h3>
<div class="outline-text-3" id="text-orge2c59cb">
<ul class="org-ul">
<li>Also, include details about any tools you ultimately abandoned.<br /></li>
<li>Describe what went well with these tools and what was challenging.<br /></li>
</ul>

<p>
I used the git cli.<br />
</p>
</div>
</div>
<div id="outline-container-org9f74652" class="outline-3">
<h3 id="org9f74652">Describe what information sources you used and how helpful (or unhelpful) they were.</h3>
<div class="outline-text-3" id="text-org9f74652">
<ul class="org-ul">
<li>Why did you need to use them?<br /></li>
<li>Why were they helpful (or unhelpful)?<br /></li>
</ul>

<p>
I did not need any external sources.<br />
</p>
</div>
</div>
<div id="outline-container-orgca6bffe" class="outline-3">
<h3 id="orgca6bffe">-Answer the following questions:</h3>
<div class="outline-text-3" id="text-orgca6bffe">
<ul class="org-ul">
<li>What were the easiest one or two steps in analyzing the Git commit history? Why were they the easiest?<br />
<ul class="org-ul">
<li>The easiest was cloning the git repo, this is something I do almost daily so it is easy.<br /></li>
</ul></li>
<li>What were the hardest one or two steps in analyzing the Git commit history? Why were they the hardest?<br />
<ul class="org-ul">
<li>The hardest part was adding the developers keys to my local store, because I initially forgot where those keys live.<br /></li>
</ul></li>
<li>What would you change about the process of analyzing the Git commit history, if anything?<br />
<ul class="org-ul">
<li>Nothing.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgce2e8f0" class="outline-3">
<h3 id="orgce2e8f0">Answer the after-scenario questionnaire (ASQ) by indicating how much you agree with the following statements on a scale of 1 (strongly disagree) to 7 (strongly agree).</h3>
<div class="outline-text-3" id="text-orgce2e8f0">
<ul class="org-ul">
<li>Overall, I am satisfied with the ease of analyzing the Git commit history.<br />
<ul class="org-ul">
<li>7<br /></li>
</ul></li>
<li>Overall, I am satisfied with the amount of time it took to analyzing the Git commit history.<br />
<ul class="org-ul">
<li>7<br /></li>
</ul></li>
<li>Overall, I am satisfied with the support information (online help, messages, documentation) I found when analyzing the Git commit history.<br />
<ul class="org-ul">
<li>7<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org186262c" class="outline-3">
<h3 id="org186262c">Provide any other feedback you have about this activity or analyzing Git commit histories.</h3>
<div class="outline-text-3" id="text-org186262c">
<p>
None.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orge44372a" class="outline-2">
<h2 id="orge44372a">Section 3—Semester-long reflection</h2>
<div class="outline-text-2" id="text-orge44372a">
</div>
<div id="outline-container-org445802b" class="outline-3">
<h3 id="org445802b">For this section, please reflect on your experience using Git commit signing in the second half of the semester.</h3>
<div class="outline-text-3" id="text-org445802b">
<p>
Git commit signing is something that I have been doing for a few years now so the entire process was familiar to me. I think it&rsquo;s a good experience, especially with the guidance from your choice of git hosting provider guiding you along the way.<br />
</p>
</div>
</div>
<div id="outline-container-orgcd29f2b" class="outline-3">
<h3 id="orgcd29f2b">Where did you store your private key? How was it secured?</h3>
<div class="outline-text-3" id="text-orgcd29f2b">
<p>
My private key was stored password protected on my laptop.<br />
</p>
</div>
</div>
<div id="outline-container-orgb718218" class="outline-3">
<h3 id="orgb718218">Did you change anything about how you signed commits throughout the second half of the semester? If so, what changes did you make? Why did you make those changes?</h3>
<div class="outline-text-3" id="text-orgb718218">
<p>
I did not, I chose the correct method the first time around.<br />
</p>
</div>
</div>
<div id="outline-container-org35d3d29" class="outline-3">
<h3 id="org35d3d29">Do you plan to start signing your Git commits outside of this class? Why or why not?</h3>
<div class="outline-text-3" id="text-org35d3d29">
<p>
Yes, I will continue to sign my commits outside of the class. I like to provide my collaborators with the confidence that I am truly the one creating commits.<br />
</p>
</div>
</div>
<div id="outline-container-org4ca0dc1" class="outline-3">
<h3 id="org4ca0dc1">Answer the system usability scale (SUS) questions by indicating how much you agree with the following statements on a scale of 1 (strongly agree) to 5 (strongly disagree).</h3>
<div class="outline-text-3" id="text-org4ca0dc1">
<ul class="org-ul">
<li>I think that I would have no problem using Git commit signing frequently.<br />
<ul class="org-ul">
<li>5<br /></li>
</ul></li>
<li>I found using Git commit signing unnecessarily complex.<br />
<ul class="org-ul">
<li>1<br /></li>
</ul></li>
<li>I thought that using Git commit signing was easy.<br />
<ul class="org-ul">
<li>5<br /></li>
</ul></li>
<li>I think that I would need the support of a technical support staff to use Git commit signing in the future.<br />
<ul class="org-ul">
<li>1<br /></li>
</ul></li>
<li>I found the various functions for using Git commit signing to be well-integrated.<br />
<ul class="org-ul">
<li>5<br /></li>
</ul></li>
<li>I thought there was too much inconsistency in using Git commit signing.<br />
<ul class="org-ul">
<li>1<br /></li>
</ul></li>
<li>I would imagine that most people would learn to use Git commit signing very quickly.<br />
<ul class="org-ul">
<li>4<br /></li>
</ul></li>
<li>I found using Git commit signing to be very cumbersome.<br />
<ul class="org-ul">
<li>1<br /></li>
</ul></li>
<li>I felt very confident using Git commit signing.<br />
<ul class="org-ul">
<li>5<br /></li>
</ul></li>
<li>I needed to learn a lot of things before I could get going with using Git commit signing.<br />
<ul class="org-ul">
<li>1<br /></li>
</ul></li>
</ul>
</div>
</div>
