cosc583/proj_ukm2/writeup.tex
\subsection*{How long did it take you to complete this activity?}
\label{sec:org90b4bbc}
10 minutes.\\
\subsection*{What steps did you take to complete the activity?}
\label{sec:orgc07f5a2}
\begin{itemize}
\item Include details about anything you attempted that ultimately did not work.\\
\item Include screenshots if you think that would be helpful.\\
\end{itemize}

I cloned the repo, added the developers keys to my local store of keys, and then ran \texttt{git log -{}-{}show-signature}.\\
\subsection*{Identify the tools you used.}
\label{sec:org5cd3758}
\begin{itemize}
\item Also, include details about any tools you ultimately abandoned.\\
\item Describe what went well with these tools and what was challenging.\\
\end{itemize}

I used the git cli.\\
\subsection*{Describe what information sources you used and how helpful (or unhelpful) they were.}
\label{sec:orga8581e9}
\begin{itemize}
\item Why did you need to use them?\\
\item Why were they helpful (or unhelpful)?\\
\end{itemize}

I did not need any external sources.\\
\subsection*{-Answer the following questions:}
\label{sec:org73534b8}
\begin{itemize}
\item What were the easiest one or two steps in analyzing the Git commit history? Why were they the easiest?\\
\begin{itemize}
\item The easiest was cloning the git repo, this is something I do almost daily so it is easy.\\
\end{itemize}
\item What were the hardest one or two steps in analyzing the Git commit history? Why were they the hardest?\\
\begin{itemize}
\item The hardest part was adding the developers keys to my local store, because I initially forgot where those keys live.\\
\end{itemize}
\item What would you change about the process of analyzing the Git commit history, if anything?\\
\begin{itemize}
\item Nothing.\\
\end{itemize}
\end{itemize}
\subsection*{Answer the after-scenario questionnaire (ASQ) by indicating how much you agree with the following statements on a scale of 1 (strongly disagree) to 7 (strongly agree).}
\label{sec:org1db8875}
\begin{itemize}
\item Overall, I am satisfied with the ease of analyzing the Git commit history.\\
\begin{itemize}
\item 7\\
\end{itemize}
\item Overall, I am satisfied with the amount of time it took to analyzing the Git commit history.\\
\begin{itemize}
\item 7\\
\end{itemize}
\item Overall, I am satisfied with the support information (online help, messages, documentation) I found when analyzing the Git commit history.\\
\begin{itemize}
\item 7\\
\end{itemize}
\end{itemize}
\subsection*{Provide any other feedback you have about this activity or analyzing Git commit histories.}
\label{sec:org79be211}
None.\\
\section*{Section 3—Semester-long reflection}
\label{sec:org8879609}
\subsection*{For this section, please reflect on your experience using Git commit signing in the second half of the semester.}
\label{sec:org8747bf4}
Git commit signing is something that I have been doing for a few years now so the entire process was familiar to me. I think it's a good experience, especially with the guidance from your choice of git hosting provider guiding you along the way.\\
\subsection*{Where did you store your private key? How was it secured?}
\label{sec:orgdb93cf1}
My private key was stored password protected on my laptop.\\
\subsection*{Did you change anything about how you signed commits throughout the second half of the semester? If so, what changes did you make? Why did you make those changes?}
\label{sec:org29270fb}
I did not, I chose the correct method the first time around.\\
\subsection*{Do you plan to start signing your Git commits outside of this class? Why or why not?}
\label{sec:org7c88515}
Yes, I will continue to sign my commits outside of the class. I like to provide my collaborators with the confidence that I am truly the one creating commits.\\
\subsection*{Answer the system usability scale (SUS) questions by indicating how much you agree with the following statements on a scale of 1 (strongly agree) to 5 (strongly disagree).}
\label{sec:org86bcade}
\begin{itemize}
\item I think that I would have no problem using Git commit signing frequently.\\
\begin{itemize}
\item 5\\
\end{itemize}
\item I found using Git commit signing unnecessarily complex.\\
\begin{itemize}
\item 1\\
\end{itemize}
\item I thought that using Git commit signing was easy.\\
\begin{itemize}
\item 5\\
\end{itemize}
\item I think that I would need the support of a technical support staff to use Git commit signing in the future.\\
\begin{itemize}
\item 1\\
\end{itemize}
\item I found the various functions for using Git commit signing to be well-integrated.\\
\begin{itemize}
\item 5\\
\end{itemize}
\item I thought there was too much inconsistency in using Git commit signing.\\
\begin{itemize}
\item 1\\
\end{itemize}
\item I would imagine that most people would learn to use Git commit signing very quickly.\\
\begin{itemize}
\item 4\\
\end{itemize}
\item I found using Git commit signing to be very cumbersome.\\
\begin{itemize}
\item 1\\
\end{itemize}
\item I felt very confident using Git commit signing.\\
\begin{itemize}
\item 5\\
\end{itemize}
\item I needed to learn a lot of things before I could get going with using Git commit signing.\\
\begin{itemize}
