cosc583/proj_ukm2/writeup.html
<div id="outline-container-orgebb6c4f" class="outline-3">
<h3 id="orgebb6c4f">Answer the following questions:</h3>
<div class="outline-text-3" id="text-orgebb6c4f">
<ul class="org-ul">
<li>What were the easiest steps to set up Git commit signing, sign a commit, or verify a commit? Why were they the easiest?<br />
<ul class="org-ul">
<li>The easiest step was to verify a commit, which can be accomplished using <code>git log --show-signature</code>. This is a fairly simple command to remember, and it can be set as a default using your git config.<br /></li>
</ul></li>
<li>What were the hardest one or two steps in setting up Git commit signing, signing a commit, or verifying a commit? Why were they the hardest?<br />
<ul class="org-ul">
<li>The hardest step was remembering to configure git to enable automatic commit signing. I found this the hardest as the git cli flags for config options are not intuitive.<br /></li>
</ul></li>
<li>What would you change about the setup process, if anything?<br />
<ul class="org-ul">
<li>If more steps could be automated that would be great, likely during an OS install or something similar.<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgdbeb580" class="outline-3">
<h3 id="orgdbeb580">How did the usability of setting up git commit signing compare to the usability of using it throughout the second half of the semester?</h3>
<div class="outline-text-3" id="text-orgdbeb580">
<p>
Using it throughout the second half of the semester was easy, and I didn&rsquo;t any change in complexity.<br />
</p>
</div>
</div>
<div id="outline-container-org9b2ddbb" class="outline-3">
<h3 id="org9b2ddbb">Provide any other feedback you have about Git commit signing.</h3>
<div class="outline-text-3" id="text-org9b2ddbb">
<p>
None.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org874c904" class="outline-2">
<h2 id="org874c904">Section 4—Thought exercises</h2>
<div class="outline-text-2" id="text-org874c904">
<p>
In this section, you will complete several thought exercises. You will receive full credit for whatever you put down. I&rsquo;m not looking for you to get the &ldquo;right&rdquo; answer, but rather for you to share your thoughts based on what you&rsquo;ve learned this semester and your experiences using Git commit signing.<br />
</p>
</div>
<div id="outline-container-orgf41f1d6" class="outline-3">
<h3 id="orgf41f1d6">Are there any security benefits or drawbacks to using Git commit signing as compared to unsigned commits? If so, what are they?</h3>
<div class="outline-text-3" id="text-orgf41f1d6">
<p>
Assuming (as with all cryptography) that the secrecy of the keys is kept fully secure git commit signing guarantees that the actual author associated with the commit was the one that wrote it. For safety/security critical code bases this is an extremely important fact, and therefore signing provides a benefit in these situations. Additionally, in larger open source projects git commit signing can help to instill confidence that a contributor is really who they say they are, assuming a network of trust is in place.<br />
</p>
</div>
</div>
<div id="outline-container-orgee5f677" class="outline-3">
<h3 id="orgee5f677">To use Git commit signing on multiple devices, you could either synchronize your existing signing key to the new machine or generate a new signing key for that machine. Each of these approaches has different potential security implications. What do you think the security benefits or drawbacks of each approach are?</h3>
<div class="outline-text-3" id="text-orgee5f677">
<p>
Copying keys between machines exposes the potential for a broader attack surface, as you are sharing a single key. This means that if any of the copies is exposed, they are all exposed. However, this does make sharing your public keys with others much easier, as they only have to have a single key for you.<br />
</p>

<p>
On the other hand, having individual keys per machine reduces the risk of being wholly compromised from a single attack, but it greatly increases the complexity of managing public keys.<br />
</p>
</div>
</div>
<div id="outline-container-orga63bdf3" class="outline-3">
<h3 id="orga63bdf3">If you were to lose your Git signing private key, what would you need to do to continue signing commits? Are there any security concerns with your proposed workflow? If so, how could they be addressed (you can answer that you don&rsquo;t know)?</h3>
<div class="outline-text-3" id="text-orga63bdf3">
<p>
You would need to generate a new key, that would then be distributed to all relevant parties. At the same time you should also ensure that your other key is &ldquo;forgotten&rdquo; so that if someone else manages to recover it, they cannot use it to continue impersonating you. The security concern is that a bad actor could just as easily compromise some other piece of your security chain, and use that to convince your network that their new key is yours.<br />
</p>
</div>
</div>
<div id="outline-container-orgc64882a" class="outline-3">
<h3 id="orgc64882a">If you were to have your Git signing private key stolen, what would you need to do to ensure the security of your repository? Are there any security concerns with your proposed workflow? If so, how could they be addressed (you can answer that you don&rsquo;t know)?</h3>
<div class="outline-text-3" id="text-orgc64882a">
<p>
You would need to revoke the use of that key as soon as possible. The security concern is if that key was used elsewhere you would need to ensure its use is blocked on every platform.<br />
</p>
</div>
</div>
