cosc583/proj_ukm2/writeup.tex
\item 1\\
\end{itemize}
\end{itemize}
\subsection*{Answer the following questions:}
\label{sec:org2fbd331}
\begin{itemize}
\item What were the easiest steps to set up Git commit signing, sign a commit, or verify a commit? Why were they the easiest?\\
\begin{itemize}
\item The easiest step was to verify a commit, which can be accomplished using \texttt{git log -{}-{}show-signature}. This is a fairly simple command to remember, and it can be set as a default using your git config.\\
\end{itemize}
\item What were the hardest one or two steps in setting up Git commit signing, signing a commit, or verifying a commit? Why were they the hardest?\\
\begin{itemize}
\item The hardest step was remembering to configure git to enable automatic commit signing. I found this the hardest as the git cli flags for config options are not intuitive.\\
\end{itemize}
\item What would you change about the setup process, if anything?\\
\begin{itemize}
\item If more steps could be automated that would be great, likely during an OS install or something similar.\\
\end{itemize}
\end{itemize}
\subsection*{How did the usability of setting up git commit signing compare to the usability of using it throughout the second half of the semester?}
\label{sec:orgcc0cdd0}
Using it throughout the second half of the semester was easy, and I didn't any change in complexity.\\
\subsection*{Provide any other feedback you have about Git commit signing.}
\label{sec:org05175ed}
None.\\
\section*{Section 4—Thought exercises}
\label{sec:orgb296802}
In this section, you will complete several thought exercises. You will receive full credit for whatever you put down. I'm not looking for you to get the ``right'' answer, but rather for you to share your thoughts based on what you've learned this semester and your experiences using Git commit signing.\\
\subsection*{Are there any security benefits or drawbacks to using Git commit signing as compared to unsigned commits? If so, what are they?}
\label{sec:orgee2f276}
Assuming (as with all cryptography) that the secrecy of the keys is kept fully secure git commit signing guarantees that the actual author associated with the commit was the one that wrote it. For safety/security critical code bases this is an extremely important fact, and therefore signing provides a benefit in these situations. Additionally, in larger open source projects git commit signing can help to instill confidence that a contributor is really who they say they are, assuming a network of trust is in place.\\
\subsection*{To use Git commit signing on multiple devices, you could either synchronize your existing signing key to the new machine or generate a new signing key for that machine. Each of these approaches has different potential security implications. What do you think the security benefits or drawbacks of each approach are?}
\label{sec:orgccb4666}
Copying keys between machines exposes the potential for a broader attack surface, as you are sharing a single key. This means that if any of the copies is exposed, they are all exposed. However, this does make sharing your public keys with others much easier, as they only have to have a single key for you.\\

On the other hand, having individual keys per machine reduces the risk of being wholly compromised from a single attack, but it greatly increases the complexity of managing public keys.\\
\subsection*{If you were to lose your Git signing private key, what would you need to do to continue signing commits? Are there any security concerns with your proposed workflow? If so, how could they be addressed (you can answer that you don't know)?}
\label{sec:org1b132db}
You would need to generate a new key, that would then be distributed to all relevant parties. At the same time you should also ensure that your other key is ``forgotten'' so that if someone else manages to recover it, they cannot use it to continue impersonating you. The security concern is that a bad actor could just as easily compromise some other piece of your security chain, and use that to convince your network that their new key is yours.\\
\subsection*{If you were to have your Git signing private key stolen, what would you need to do to ensure the security of your repository? Are there any security concerns with your proposed workflow? If so, how could they be addressed (you can answer that you don't know)?}
\label{sec:orga066b47}
You would need to revoke the use of that key as soon as possible. The security concern is if that key was used elsewhere you would need to ensure its use is blocked on every platform.\\
