cosc583/proj_ukm2/writeup.html
<div id="outline-container-org75e8cc3" class="outline-3">
<h3 id="org75e8cc3">Consider an open source project that&rsquo;s widely used, and attackers would like to get their code into this repository. What might attackers try to do to compromise that repository? What practices would you recommend that developers of this repo take to ensure that no malicious commits are added to their codebase?</h3>
<div class="outline-text-3" id="text-org75e8cc3">
<p>
As an attacker I would choose to play the long game where I initially submit good-faith pull requests to build trust with the maintainers of a project. After this trust had been established I would then take some piece of code that I was responsible for and rewrite it to insert my malicious code, knowing that I have the most authority over this area of the code.<br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Mon Dec  1 17:19:09 2025</p>
<p class="author">Author: Jackson Mowry</p>
<p class="date">Created: 2025-12-01 Mon 18:18</p>
</div>
</body>
</html>
