cosc583/proj_ukm2/writeup.tex
\subsection*{Consider an open source project that's widely used, and attackers would like to get their code into this repository. What might attackers try to do to compromise that repository? What practices would you recommend that developers of this repo take to ensure that no malicious commits are added to their codebase?}
\label{sec:orge20559a}
As an attacker I would choose to play the long game where I initially submit good-faith pull requests to build trust with the maintainers of a project. After this trust had been established I would then take some piece of code that I was responsible for and rewrite it to insert my malicious code, knowing that I have the most authority over this area of the code.\\
\end{document}
